luctronics-ET/__aguada__/firmware/gateway_usb/sdkconfig.defaults
# Configurações padrão para ESP32-C3 SuperMini
# Gateway USB - Bridge ESP-NOW para Serial

# Configuração do target
CONFIG_IDF_TARGET="esp32c3"

# Console USB nativo (importante para C3 SuperMini!)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Logs
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# WiFi/ESP-NOW
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# Otimização de tamanho
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
